tutorials/compressible/nexaFoam/neTCLib/heatBath_air5_backup/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs 
(
    "libneTCLib_2T.so"
);

application     nexaFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1e-03;

deltaT          1e-09;

writeControl    runTime;

writeInterval   1e-09;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

graphFormat     raw;

runTimeModifiable true;

adjustTimeStep  no;

maxCo           0.2;

maxDeltaT       1e-02;

functions
{
/*
    xLineSample
    {
        type            sets;
        libs            ("libsampling.so");   // sampling library
        enabled         true;

        // when postProcess runs, it will write once at the selected time(s)
        writeControl    writeTime;

        setFormat       csv;
        interpolationScheme cellPoint;

        sets
        (
            xLine
            {
                type    uniform;
                axis    x;

                // choose line endpoints in your domain
                start   (-5 0 0);
                end     (5 0 0);

                // match paper resolution, or increase for smoother curves
                nPoints 200;
            }
        );

        fields (p U);
    }*/
    
    neReactionRates
    {
        type            ne2TSpecieReactionRates;
        libs            ("libneChemistryModel.so");

        writeControl    timeStep;
        writeInterval   1;

        // optional: restrict to a cellZone / region later if wanted
    }
    reactionTracker
    {
        type              ne2TReactionTracker;
        libs              ("libneChemistryModel.so");

        writeControl      timeStep;
        writeInterval     1;

        activityTolerance 1e-20;
        writeToLog        true;
    }
}


// ************************************************************************* //
